[{
    "_id": "6220e47a8d3bc9c83c931578",
    "title": "Charity provides leaves for loved ones with new memory tree",
    "date": "01/01/2022",
    "time": "01.01pm",
    "image": "https://www.charitytoday.co.uk/wp-content/uploads/2022/03/Charity-Katie-McKeiver-scaled-e1646221971885.jpg",
    "description": "RELATIVES of those who have sadly lost a loved one can now celebrate and remember their lives by funding an engraved leaf on the Rotherham Hospital and Community Charity’s new memory tree. copper tree is located in the Snowdrop memorial garden at Rotherham Hospital with the first gold leaf dedicated to Tommy McKeiver’s wife Mary. Tommy, 83, of Boardman Avenue, Rawmarsh, sadly lost his wife of 56 years in August 2019 after she suffered a brief illness.Tommy and his family were able to spend Mary’s final few hours in the charity-funded Purple Butterfly room on Ward A2. To commemorate the anniversary of her death, Tommy has donated £500 to the charity’s Purple Butterfly Appeal every year and pledged to be the first memory tree donor.’s granddaughter, Katie McKeiver, a Healthcare Support Worker at The Rotherham NHS Foundation Trust, said:“Since nannan passed away the charity has felt really important to me, my grandad and my sisters. It’s lovely that grandad remembers nannan every year on the anniversary of her death by donating to the charity and to have a leaf of the new memory tree is just lovely.“We’re so proud that she is the first. It’s nice to come to the Snowdrop garden, to see her name up there and to remember how much she is still loved. Losing nannan was heart-breaking but sponsoring a leaf feels like a positive thing to do in her memory.”leaf has also been added in memory of 61-year-old Sandra Farthing, who started her career at the Trust as a student nurse and went on to become a midwife for 42 years. She sadly passed away in January 2021. Her leaf was requested by her friends and colleagues in Maternity Services and is dedicated to a ‘calm, kind, gentle and phenomenal midwife.’The Snowdrop memorial garden was funded by a generous £11,557 donation from the national baby loss charity 4Louis in 2020. A leaf has also been proudly added to the tree for Louis Knight, who passed away in 2009 and inspired his family to set up the charity to support other families through the loss of a baby or child."
  },
  {
    "_id": "6220e5048d3bc9c83c93157a",
    "title": "Partnership will help families supported by Francis House Children’s Hospice",
    "date": "02/01/2022",
    "time": "05.00pm",
    "image": "https://www.charitytoday.co.uk/wp-content/uploads/2022/02/Tina-Nesbitt-Jack-Nesbitt-at-Francis-House-e1645436138202.jpg",
    "description": "When life’s short there’s no time to waste: New Morrisons charity partnership with Together for Short Lives to help families supported by Francis House Children’s Hospice, an Official Partner Charity of the UK Charity Week campaign.Welcome news for Francis House Children’s Hospice today as a new partnership launches between supermarket giant, Morrisons and charity, Together for Short Lives that will benefit families caring for a seriously ill child from across Greater Manchester.Together for Short Lives and Morrisons are set to raise vital funds for children’s hospices across the country, just like Francis House, as part of a flagship three-year partnership launched this month.Francis House will be twinned with more than 20 Morrisons stores within a 30-mile radius of the Didsbury based hospice including Oldham, Stockport, Manchester, Eccles and Dukinfield. House fundraising officer Julie Williams said:“We are very excited to be part of this national partnership with Together for Short Lives and Morrisons and are looking forward to working with all of the Morrisons stores across the Greater Manchester area.“Francis House touches the lives of more than 550 families who are caring for a child with a life-limiting or life-threatening condition. We are here for the whole family through their good days, their tough days and their last days.“The partnership will mean communities, Morrisons colleagues and customers will be supporting families who are facing the toughest of challenges and helping them make the most of every moment that they have together"
  },
  {
    "_id": "6220e5818d3bc9c83c93157c",
    "title": "Registration is now open for brand new hospice event",
    "date": "05/01/2022",
    "time": "07.00pm",
    "image": "https://www.charitytoday.co.uk/wp-content/uploads/2022/03/3.-Registration-is-now-open-for-brand-new-hospice-event-1-scaled-e1646227425391.jpg",
    "description": "REGISTRATION is now open for St Barnabas House’s brand-new walk, Sunrise to Remember.Taking place on 25 June 2022, Sunrise to Remember promises all the excitement and camaraderie of the hospice’s celebrated midnight walk, Night to Remember, but with a special sunrise twist.Instead of walking through the night, hundreds of supporters will be setting off from Worthing Leisure Centre at 4.15am, walking from darkness into the sunrise on a 10 or 20-kilometre route through the tree-lined paths of Worthing, across fields, down rivers and along the beautiful coastline.Speaking about Sunrise to Remember, Fiona James at St Barnabas House, saidWhether it’s for fun or fitness, as a challenge or in memory of a loved one, participants are promised a Sunrise to Remember. We know it might be tough setting off at 4.15am, but there will be an enormous sense of pride when you cross that finish line!“And to help you on your way, we will provide you with a free Sunrise to Remember t-shirt to wear with pride and fundraising support along the way. Are you ready to rise to the challenge for hospice care – now and in the future?”Sunrise to Remember is open to all ages. Registration is £25 per person and £15 for children under 14, there is also a family ticket (please see the website for details) available for £65. Anyone under 18 must be accompanied by an adult. Sign up before 14 April 2022 and receive an early bird discount of 20% per person."
  },
  {
    "_id": "6220e5e68d3bc9c83c93157e",
    "title": "Construction begins on HMT specialist dementia care home in Climping",
    "date": "07/01/2022",
    "time": "10.00pm",
    "image": "https://www.charitytoday.co.uk/wp-content/uploads/2022/03/Job-Vacancy@2x-8-e1646307033318.png",
    "description": "HEALTHCARE Management Trust (HMT), the charity which provides health and social care while reinvesting any surplus income back into dementia care research, will be opening a specialist dementia care home in the village of Climping, near the seaside town of Littlehampton, West Sussex. The care home is a pioneering innovation within the care industry, both in terms of its design and the care it offers. The care home is designed to feel less like a care home and more like a familiar home for residents. Designed over two storeys, the home incorporates four separate wings with 16 bedrooms in each wing. The wings are split equally into two distinct households of eight-bed ‘homes,’ each with their own domestic kitchen, dining and day lounge spaces. The residents will live in small family ‘homes’ with others at a similar stage of dementia; important for reducing stress and helping in the socialisation of residents.’s unique, research-led approach offers residents a holistic and ‘family’ approach to the physical and mental well-being of each resident. Members of each ‘family’, where possible, are involved in purposeful day-to-day domestic activities which provide social interactions, value and routine to their day. The preferences, quirks, history and personality traits of each individual are understood and valued by staff. As a result, staff forge genuine and long-lasting relationships with both the resident and their relatives.Each unit features generous ensuite bedrooms, communal areas such as lounges, dining rooms, reading rooms, a garden lounge and terraces overlooking the landscaped and secure purpose-designed grounds for people with dementia and their visitors, together with ample car parking. Additional well-being facilities include a hair salon, café, shop and tea room."
  },
  {
    "_id": "6220e7278d3bc9c83c931580",
    "title": "Digital entertainment and engagement startup offer software to charity for free",
    "date": "14/01/2022",
    "time": "07.00am",
    "image": "https://www.charitytoday.co.uk/wp-content/uploads/2022/03/Palco-Leone-Crescenzi-2-e1646144557451.png",
    "description": "A tech startup specialising in engagement using digital entertainment is offering the use of its software to a UK charity for free for six months.Palco is a SaaS startup helping brands and organisations improve their audience engagement. They are now inviting charities interested in exploring new ways to engage their supporter base to get in touch, with a view to offering their interactive trivia game for free for six months. company was set up in 2018 by Leone Crescenzi, a former tv producer, celebrity consultant and marketer. Having spent much of his career working in traditional media, Crescenzi saw how engagement with live shows on tv was falling while comparable shows on digital platforms like Twitch, Instagram and Facebook were gaining traction. response, he created Palco. In addition to interactive live shows, the digital entertainment specialist is also developing a fully customisable interactive trivia game. It will provide its customers with new, tailored content to share with their audiences, with machine learning capturing every interaction and providing detailed insights so they can create better, more powerful marketing campaigns.Organisations and brands spend years building their audience, but it’s very hard to ‘activate’ that community and engage them fully. That’s where we come in. Palco is all about engagement. Each piece of content and software we create is geared towards improving audience engagement.”Palco are now offering their interactive trivia game for free to a UK charity aiming to increase its supporter engagement. The chosen charity will benefit from the use of a fully branded game for six months, with the ability to customise, change and edit the questions to suit their needs. If the organisation wishes to continue using the service after the initial six-month period, Palco will offer one year’s access to MAGIQ for free. Access to the MAGIQ dashboard will allow them to profile their audience, create groups based on interests, demographics, or any other filter and import the data in a CRM for their future marketing activities.."
  },
  {
    "_id": "6220e8848d3bc9c83c931582",
    "title": "City to stop using COVID-related curbside parking",
    "date": "21/01/2022",
    "time": "011.00am",
    "image": "https://www.villagelivingonline.com/downloads/3606/download/City%20City%20Hall%203.jpg?cb=250f5d26919967f7fb2d079057e61d3b&w=640&h=",
    "description": "City City Hall 3The Mountain Brook City Council voted Feb. 14 to stop using nearly 40 parking spaces in the villages as temporary curbside pickup spots.The council passed an ordinance designating the spaces in May 2020 to facilitate contactless, curbside pickup for customers at eateries and retailers during the early days of the COVID-19 pandemicHowever, several council members said the use of the spots for curbside pickup had outlived its usefulness and was taking up badly needed regular parking.Several residents complained recently that it was difficult to find parking spaces in the villages, especially during the lunch rush, Councilor Billy Pritchard said.Pritchard said he didn’t want the merchants and restaurants to be hurt.According to the original ordinance, people using the pickup spaces are supposed to stay in their cars, said Councilor Alice Womack.“I don’t think that’s happening,” Womack said. “I think people are leaving their cars. It’s become a 15-minute parking spot, not a pickup spot.”Making the spaces regular parking again is “the right move,” said Suzan Doidge, executive director of the Mountain Brook Chamber of Commerce. “We have a number of new restaurants coming into the community and need all the spaces we can get,” Doidge said.Dana Hazen, the city’s director of planning, building and sustainability, told members there were 39 of the spaces remaining, all of them in Crestline Village or Mountain Brook Village.The number of curbside spaces has been adjusted a few times since the original ordinance was passed.The council has renewed the ordinance several times over that period, though the last  renewal had already ended, said City Clerk Heather Richards."
  },
  {
    "_id": "6220e98d8d3bc9c83c931584",
    "title": "Breakthrough could mean more effective treatment for patients with lethal brain tumour",
    "date": "05/02/2022",
    "time": "08.00pm",
    "image": "https://www.charitytoday.co.uk/wp-content/uploads/2022/03/Job-Vacancy@2x-7.png",
    "description": "CGBM patient Emma Crabtree, 50, from Skipton in North Yorkshire, said:For someone like me, living with this disease, it is amazing to hear about this step forward. I realise how fortunate I am to be considered a long-term survivor of the disease and to be living a good quality of life because many others are not so lucky. News of a significant scientific breakthrough provides hope to me and thousands of others.”Arginine is an amino acid used in the production of complex molecules called proteins, which conduct a vast range of functions within cells. Arginine is required by a variety of cancer cells, especially ones that are growing quickly, and therefore depriving tumours of this amino acid has been explored as a potential anti-cancer strategy in a variety of tumour types, including GBM.Whilst 70% of GBM tumours are able to make arginine, 30% are not. In this study, the research team focused on the tumours that can make arginine by exposing them to a drug called ADI-PEG20. This drug degrades arginine and the aim was to deprive tumours from access to arginine. The team is also exploring the potential for using ADI-PEG20 in the 30% of tumours that are not able to make arginine. If successful, this would mean that all GBM patients could be treated with arginine depletion. arginine is degraded by ADI-PEG20, a chemical called nitric oxide is produced. This has the added effect of activating immune cells that are located throughout the brain and spinal cord. Many tumours are able to suppress immune cells, thereby evading removal by the immune system. However, the production of nitric oxide, which is toxic to cells, appeared to activate immune cells around the tumour. Importantly, using ADI-PEG20 had its greatest effect on tumours when used alongside ionising radiotherapy."
  },
  {
    "_id": "6220eab68d3bc9c83c931586",
    "title": "Making it work: Mountain Brook merchants using every tool to reach, support customers during pandemic",
    "date": "15/02/2022",
    "time": "10.00pm",
    "image": "https://www.villagelivingonline.com/downloads/16774/download/COVER---Reopen-MB_200701_CookStoreEN05.jpg?cb=a74d8202f1e92555ca6b0b62615c2ffb&w=2200&h=",
    "description": "“We were really not going to let this stop us,” Lassen said.“We helped each other a lot,” said Dolata-badi, who eagerly followed Lassen’s posts on social media as she continued to promote her products.There were some stores ... that just shut down and put their head in the sand, so seeing her posting inspired us every day,” Dolatabadi said.Businesses also partnered for joint promotions. Mon Ami, a children’s boutique in Crestline Village, did a promotion with Sugar, a candy shop, during the #ReopenMB event in June. Matters, a gift shop, and Mountain Brook Creamery did a joint promotion on Instagram in June called Puzzles and a Pint.”ADAPT AND SURVIVELassen, like many other local merchants, used every tool at her disposal.“I’m working social media everyday to give people ideas of what they might need or want to buy as gifts,” she said in April. “I am FaceTiming, texting and emailing pictures. I offer curbside pickup, free delivery within the area and shipping via UPS.”Social media “does not come to me naturally,” Lassen said, but she found success by being “a real person” and using Instagram or Facebook to make “a connection personally, whether I know you or not.”“I decided I could talk on social media just like I could talk to you if you were standing in front of me,” she said.Lassen also did more than merely feature products, she said. “‘I’ve also got a great recipe that you can use that cookie sheet for.”Smith relied on Facebook and particularly Instagram, which allowed customers to see items such as graduation gifts “instantly,” she said.Please Reply also began offering curbside pickup and “definitely increased our sales on the internet from all the years past,” Smith said.Dolatabadi, who operates BPrince with his wife, Andrea, and his sister, Simin Regina, said they only began selling online in summer 2019.“It was perfect timing,” he said, noting that online sales “really took off during COVID-19"
  }
]